src/DataProcessors/ОбменСОфлайнОборудованием.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ОбменСОфлайнОборудованием</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ДанныеСортировки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/МоментыПоследнейЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>МоментыПоследнейЗагрузки</Name>
			<Comment>Предназначен для регистрации моментов последней загрузки оборудования в разрезе видов загружаемых данных</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МоментПоследнейЗагрузки</Name>
					<Comment>Момент последней загрузки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Оборудование</Name>
					<Comment>Оборудование</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗагружаемойИнформации</Name>
					<Comment>Вид загружаемой информации</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗагружаемойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерPOS</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ТоварыВОборудовании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ТоварыВОборудовании</Name>
			<Comment>Сведения о товарах которые выгружаются в оборудование</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерЯчейки</Name>
					<Comment>Номер ячейки PLU</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МоментИзменения</Name>
					<Comment>Момент последнего изменения товара. Если момент больше чем "момент последней загрузки" оборудования, то этот товар надо выгрузить в оборудование</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВыполненаПечатьЦенников</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ГруппаТоваров</Name>
					<Comment>Группа товаров оборудования</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыТоваровОборудования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Comment>Штрих-код</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ВидыЗагружаемойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыЗагружаемойИнформации</Name>
			<Comment>Виды загружаемой в оборудование информации</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товары</Name>
					<Comment>Карточки товаров, единицы измерения, штрихкоды</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Скидки</Name>
					<Comment>Скидки</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДисконтныеКарты</Name>
					<Comment>Дисконтные карты</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Персонал</Name>
					<Comment>Сведения о кассирах</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Остатки</Name>
					<Comment>Сведения об остатках товаров</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ПодключаемоеОборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ПодключаемоеОборудование</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидТранспортаОфлайнОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТранспортаОфлайнОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДрайверОборудования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДрайверыОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторWebСервисОборудования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторУстройства</Name>
					<Comment>Уникальный идентификатор устройства стандарта оборудования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияБПО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособФорматноЛогическогоКонтроля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыФорматноЛогическогоКонтроля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопустимоеРасхождениеФорматноЛогическогоКонтроля</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПодключаемогоОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОфлайнОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОфлайнОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяПереустановка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяУстановка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВерсияФорматаОбмена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОбработчикДрайвера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбработчикиДрайверовПодключаемогоОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстройствоИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаТоваровОборудования</Name>
					<Comment>Группа товаров оборудования, объединяющая товары, которые загружаются в данное оборудование</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыТоваровОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексМагазина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойОтдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРарусОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРарусОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьТовары</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьСкидки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьПерсонал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполнятьПоРасписанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентноеЗадание</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьРасписания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностиРасписанийРассылокОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьПродажи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПризнакСпособаРасчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПризнакПредметаРасчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаЗагрузкиЧековИКассовыхСмен</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыРегистрации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/ОбменСОфлайнОборудованием/Forms/Форма/Ext/Form/Module.bsl
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьПараметрыРабочегоМеста()
	
	Если ТекущееРабочееМесто = Справочники.РабочиеМеста.ПустаяСсылка()
		Или ТекущееРабочееМесто <> ПараметрыСеанса.РабочееМестоКлиента Тогда
	
		ТекущееРабочееМесто = ПараметрыСеанса.РабочееМестоКлиента;
	КонецЕсли;
	
	ЛевоеЗначение = Новый ПолеКомпоновкиДанных("РабочееМесто");
	ОтборРабочееМесто = Неопределено;
	Для Каждого ТекущийОтбор Из СписокОборудования.Отбор.Элементы Цикл
		Если ТекущийОтбор.ЛевоеЗначение = ЛевоеЗначение Тогда
			ОтборРабочееМесто = ТекущийОтбор;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ОтборРабочееМесто = Неопределено Тогда
		ОтборРабочееМесто = СписокОборудования.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборРабочееМесто.ЛевоеЗначение = ЛевоеЗначение;
	КонецЕсли;

	ОтборРабочееМесто.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборРабочееМесто.ПравоеЗначение = ТекущееРабочееМесто;
	ОтборРабочееМесто.Использование  = Истина;
	
	ВсеРабочиеМеста = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеОперации(Результат, Параметры) Экспорт
	
	Если Результат.Результат Тогда
		ОтветОтУстройства = НСтр("ru = 'Выполнение операции успешно завершено'");
		Если Элементы.СтраницыСтатусФоновогоЗадания.Видимость Тогда
			Элементы.СтраницыСтатусФоновогоЗадания.Видимость = Ложь;
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(Результат.ОписаниеОшибки) Тогда
		ОтветОтУстройства = НСтр("ru = 'В процессе выполнения операции произошла ошибка
		|%1'");
		ОтветОтУстройства = СтрЗаменить(ОтветОтУстройства, "%1", Результат.ОписаниеОшибки);
		Если Элементы.СтраницыСтатусФоновогоЗадания.Видимость Тогда
			Элементы.СтраницыСтатусФоновогоЗадания.ТекущаяСтраница = Элементы.ЗаданиеЗавершеноСОшибкой;
			Элементы.ПодробноеПредставлениеОшибки.Заголовок = ОтветОтУстройства;
		КонецЕсли;
	Иначе
		ОтветОтУстройства = НСтр("ru = 'В процессе выполнения операции произошла ошибка'");
		Если Элементы.СтраницыСтатусФоновогоЗадания.Видимость Тогда
			Элементы.СтраницыСтатусФоновогоЗадания.ТекущаяСтраница = Элементы.ЗаданиеЗавершеноСОшибкой;
			Элементы.ПодробноеПредставлениеОшибки.Заголовок = ОтветОтУстройства;
		КонецЕсли;
	КонецЕсли;
		
	//ОтветОтУстройства = ?(Результат.Результат, НСтр("ru = 'Выполнение операции успешно завершено'"), НСтр("ru = 'В процессе выполнения операции произошла ошибка'"));
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОтветОтУстройства);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокВесов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ПодключаемоеОборудование.Ссылка КАК ИдентификаторУстройства,
	|	ПодключаемоеОборудование.ГруппаТоваровОборудования КАК ГруппаТоваров,
	|	МАКСИМУМ(ЕСТЬNULL(ТабМоментыПоследнейЗагрузки.МоментПоследнейЗагрузки, ДатаВремя(1,1,1))) КАК МоментПоследнейЗагрузки
	|ПОМЕСТИТЬ
	|	ПодключаемоеОборудование
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.МоментыПоследнейЗагрузки КАК ТабМоментыПоследнейЗагрузки
	|ПО
	|	ПодключаемоеОборудование.Ссылка = ТабМоментыПоследнейЗагрузки.Оборудование И 
	|	ТабМоментыПоследнейЗагрузки.ВидЗагружаемойИнформации = ЗНАЧЕНИЕ(Перечисление.ВидыЗагружаемойИнформации.Товары)
	|ГДЕ
	|	ПодключаемоеОборудование.ПометкаУдаления = ЛОЖЬ И 
	|	ПодключаемоеОборудование.ДрайверОборудования = ЗНАЧЕНИЕ(Справочник.ДрайверыОборудования.ДрайверDIGIВесыСПечатьюЭтикеток) И 
	|	ПодключаемоеОборудование.ВыполнятьПоРасписанию = ИСТИНА И 
	|	ПодключаемоеОборудование.УстройствоИспользуется = ИСТИНА
	|СГРУППИРОВАТЬ ПО
	|	ПодключаемоеОборудование.Ссылка,
	|	ПодключаемоеОборудование.ГруппаТоваровОборудования
	|;
	|
	|ВЫБРАТЬ ПЕРВЫЕ 15
	|	ПодключаемоеОборудование.ИдентификаторУстройства,
	|	МАКСИМУМ(ПодключаемоеОборудование.МоментПоследнейЗагрузки) КАК МоментПоследнейЗагрузки,
	|	МАКСИМУМ(ТоварыВОборудовании.МоментИзменения) КАК МоментИзменения
	|ИЗ
	|	ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ТоварыВОборудовании КАК ТоварыВОборудовании
	|ПО
	|	ТоварыВОборудовании.ГруппаТоваров = ПодключаемоеОборудование.ГруппаТоваров
	//|ГДЕ
	//|	ВЫБОР
	//|			КОГДА &УстанавливатьОтборПоПодразделению
	//|				ТОГДА ПодключаемоеОборудование.ИдентификаторУстройства.ОсновнойОтдел.ПодразделениеКомпании = &ПодразделениеКомпании
	//|			ИНАЧЕ ИСТИНА
	//|		КОНЕЦ
	|СГРУППИРОВАТЬ ПО 
	|	ПодключаемоеОборудование.ИдентификаторУстройства
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(ТоварыВОборудовании.МоментИзменения) > МАКСИМУМ(ПодключаемоеОборудование.МоментПоследнейЗагрузки)
	|УПОРЯДОЧИТЬ ПО
	|	МоментПоследнейЗагрузки
	|";

	//Если ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.ПолныеПрава) Тогда
	//	Запрос.УстановитьПараметр("УстанавливатьОтборПоПодразделению", ЛОЖЬ);
	//Иначе
	//	Запрос.УстановитьПараметр("УстанавливатьОтборПоПодразделению", ИСТИНА);
	//КонецЕсли;
	//
	//Запрос.УстановитьПараметр("ПодразделениеКомпании", ПараметрыСеанса.ТекущийПользователь.ПодразделениеКомпании);
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИдентификаторУстройства");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработчикОжиданияВыполненияОбменаПоРасписанию()
	
	Устройства = ПолучитьСписокВесов();
	Если Устройства.Количество()>0 Тогда
		ПодключаемоеОборудованиеOfflineКлиент.ВыгрузитьТоварыВВесы(Неопределено, Устройства, Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура АвтоматическиеОбменыВесовПриИзменении(Элемент)
	
	Элементы.ИнтервалОбменовВесов.Доступность = АвтоОбменыВесов;
	
	ОтключитьОбработчикОжидания("ОбработчикОжиданияВыполненияОбменаПоРасписанию");
	
	Если АвтоОбменыВесов Тогда
		ПодключитьОбработчикОжидания("ОбработчикОжиданияВыполненияОбменаПоРасписанию", ИнтервалОбменовВесов, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалОбменовВесовПриИзменении(Элемент)
	
	ОтключитьОбработчикОжидания("ОбработчикОжиданияВыполненияОбменаПоРасписанию");
	
	Если АвтоОбменыВесов Тогда
		ПодключитьОбработчикОжидания("ОбработчикОжиданияВыполненияОбменаПоРасписанию", ИнтервалОбменовВесов, Ложь);
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ИнтервалОбменовВесов = 60;
	
	Если (НЕ ВыгружатьПерсонал) И (НЕ ВыгружатьСкидки) И (НЕ ВыгружатьТовары) Тогда
		ВыгружатьТовары = Истина;
	КонецЕсли;
	
	МенеджерОфлайнОборудованияПереопределяемый.ФормаОбменСОфлайнОборудованиемПриСозданииНаСервере(ЭтотОбъект);
	
	ОбновитьПараметрыРабочегоМеста();
	
	Элементы.СтраницыСтатусФоновогоЗадания.ТекущаяСтраница = Элементы.ЗаданиеВыполняется;
	Элементы.СтраницыСтатусФоновогоЗадания.Видимость       = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененоРабочееМестоТекущегоСеанса" Тогда
		ОбновитьПараметрыРабочегоМеста();
	ИначеЕсли ИмяСобытия = "ИзмененыДоступныеТипыПодключаемогоОборудования" Тогда
		ОбновитьПараметрыРабочегоМеста();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормыККМ

&НаКлиенте
Процедура ВыгрузитьДанные(Команда)
	
	ТекущиеДанные = Элементы.СписокОборудования.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если (НЕ ВыгружатьПерсонал) И (НЕ ВыгружатьСкидки) И (НЕ ВыгружатьТовары) Тогда
		ТекстСообщения = НСтр("ru = 'Не указаны параметры выгрузки: Товары, Скидки или Персонал'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПараметрыДанных = Новый Структура;
	ПараметрыДанных.Вставить("ПолнаяВыгрузка",    Ложь);
	ПараметрыДанных.Вставить("ВыгружатьТовары",   ВыгружатьТовары);
	ПараметрыДанных.Вставить("ВыгружатьСкидки",   ВыгружатьСкидки);
	ПараметрыДанных.Вставить("ВыгружатьПерсонал", ВыгружатьПерсонал);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеОперации", ЭтотОбъект);
	
	МенеджерОборудованияРарусКлиент.ВыполнитьКомандуОборудования("ВыгрузитьДанные", ТекущиеДанные.Ссылка, УникальныйИдентификатор, ОписаниеОповещения, ПараметрыДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьНастройки(Команда)
	
	ТекущиеДанные = Элементы.СписокОборудования.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		//МенеджерОборудованияРарусКлиент.НачатьВыгрузкуНастроекНаККМ(ТекущиеДанные.Ссылка, УникальныйИдентификатор, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьПолныйПрайсЛист(Команда)
	
	ТекущиеДанные = Элементы.СписокОборудования.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если (НЕ ВыгружатьПерсонал) И (НЕ ВыгружатьСкидки) И (НЕ ВыгружатьТовары) Тогда
		ТекстСообщения = НСтр("ru = 'Не указаны параметры выгрузки: Товары, Скидки или Персонал'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПараметрыДанных = Новый Структура;
	ПараметрыДанных.Вставить("ПолнаяВыгрузка",    Истина);
	ПараметрыДанных.Вставить("ВыгружатьТовары",   ВыгружатьТовары);
	ПараметрыДанных.Вставить("ВыгружатьСкидки",   ВыгружатьСкидки);
	ПараметрыДанных.Вставить("ВыгружатьПерсонал", ВыгружатьПерсонал);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеОперации", ЭтотОбъект);
	
	МенеджерОборудованияРарусКлиент.ВыполнитьКомандуОборудования("ВыгрузитьДанные", ТекущиеДанные.Ссылка, УникальныйИдентификатор, ОписаниеОповещения, ПараметрыДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПрайсЛист(Команда)
	
	ТекущиеДанные = Элементы.СписокОборудования.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		
		//МенеджерОборудованияРарусКлиент.НачатьОчисткуТоваровВККМOffline(ТекущиеДанные.Ссылка, УникальныйИдентификатор, Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	
	ТекущиеДанные = Элементы.СписокОборудования.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.СтраницыСтатусФоновогоЗадания.ТекущаяСтраница = Элементы.ЗаданиеВыполняется;
	Элементы.ДлительнаяОперацияПояснение.Заголовок = "Загрузка данных из оборудования <" + СокрЛП(ТекущиеДанные.Ссылка)+">";
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьПрогрессВыполнения     = Истина;
	ПараметрыОжидания.ВыводитьОкноОжидания           = Ложь;
	ПараметрыОжидания.ВыводитьСообщения              = Истина;
	ПараметрыОжидания.ОповещениеОПрогрессеВыполнения = Новый ОписаниеОповещения("ОбработатьПрогресс", ЭтотОбъект);
	
	ПараметрыДанных = Новый Структура;
	ПараметрыДанных.Вставить("ПараметрыОжидания", ПараметрыОжидания);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеОперации", ЭтотОбъект);
	
	МенеджерОборудованияРарусКлиент.ВыполнитьКомандуОборудования("ЗагрузитьДанные", ТекущиеДанные.Ссылка, УникальныйИдентификатор, ОписаниеОповещения, ПараметрыДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПрогресс(Результат, Параметры) Экспорт
	
	Если НЕ Элементы.СтраницыСтатусФоновогоЗадания.Видимость Тогда
		Элементы.СтраницыСтатусФоновогоЗадания.Видимость       = Истина;
		Элементы.СтраницыСтатусФоновогоЗадания.ТекущаяСтраница = Элементы.ЗаданиеВыполняется;
	КонецЕсли;
	
	Если НЕ Результат.Свойство("Прогресс") Тогда
		Если Результат.Статус = "Выполняется" Тогда
			Элементы.ДлительнаяОперацияПояснение.Заголовок = Результат.Сообщение;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Прогресс = Результат.Прогресс;
	Если ТипЗнч(Прогресс) = Тип("Структура") Тогда
		Если Прогресс.Свойство("ДополнительныеПараметры") И ТипЗнч(Прогресс.ДополнительныеПараметры) = Тип("Структура") Тогда
			Элементы.ДлительнаяОперацияПояснение.Заголовок = Прогресс.ДополнительныеПараметры.ТекстПрогресса;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(Результат.Сообщения) = Тип("ФиксированныйМассив") Тогда
		Для Каждого Сообщение Из Результат.Сообщения Цикл
			Если Сообщение.Текст = "" Тогда
				Продолжить;
			КонецЕсли;
			ВывестиСообщение(Сообщение.Текст);
		КонецЦикла;
		Результат.Сообщения = Новый ФиксированныйМассив(Новый Массив);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборРабочегоМестаЗавершение(Результат, Параметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") И Результат.Свойство("РабочееМесто") Тогда 
		МенеджерОборудованияКлиент.УстановитьРабочееМесто(Результат.РабочееМесто);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущееРабочееМестоНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ВыборРабочегоМестаЗавершение", ЭтотОбъект);
	МенеджерОборудованияКлиент.ПредложитьВыборРабочегоМеста(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВсеРабочиеМестаПриИзменении(Элемент)
	
	ЛевоеЗначение = Новый ПолеКомпоновкиДанных("РабочееМесто");
	ОтборРабочееМесто = Неопределено;
	Для Каждого ТекущийОтбор Из СписокОборудования.Отбор.Элементы Цикл
		Если ТекущийОтбор.ЛевоеЗначение = ЛевоеЗначение Тогда
			ОтборРабочееМесто = ТекущийОтбор;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ОтборРабочееМесто = Неопределено Тогда
		ОтборРабочееМесто.Использование  = (Не ВсеРабочиеМеста);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормыККМ

&НаКлиенте
Процедура ВыгрузитьДанныеВесы(Команда)
	
	ВыделенныеСтроки = Элементы.Весы.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество()>0 Тогда
		
		Устройства = Новый Массив;
		Для Каждого ТекущаяСтрока Из ВыделенныеСтроки Цикл
			Устройства.Добавить(ТекущаяСтрока);
		КонецЦикла;
		
		ПодключаемоеОборудованиеOfflineКлиент.ВыгрузитьТоварыВВесы(Неопределено, Устройства);
		
	Иначе
		
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Команда не может быть выполнена для указанного объекта'"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьДанныеВесов(Команда)
	
	ВыделенныеСтроки = Элементы.Весы.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество()>0 Тогда
		
		Устройства = Новый Массив;
		Для Каждого ТекущаяСтрока Из ВыделенныеСтроки Цикл
			Устройства.Добавить(ТекущаяСтрока);
		КонецЦикла;
		
		ПодключаемоеОборудованиеOfflineКлиент.ОчиститьТоварыВВесах(Неопределено, Устройства);
		
	Иначе
		
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Команда не может быть выполнена для указанного объекта'"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьМоментВыгрузкиВВесыНаСервере()
	
	Для Каждого Строка Из Элементы.Весы.ВыделенныеСтроки Цикл
		НаборЗаписей = РегистрыСведений.МоментыПоследнейЗагрузки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Оборудование.Установить(Строка.Ссылка);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Оборудование             = Строка.Ссылка;
			НоваяЗапись.ВидЗагружаемойИнформации = Перечисления.ВидыЗагружаемойИнформации.Товары;
			НоваяЗапись.НомерPOS                 = 0;
			НоваяЗапись.МоментПоследнейЗагрузки  = ТекущаяДатаСеанса();
		Иначе
			Для Каждого ТекущаяСтрока Из НаборЗаписей Цикл
				ТекущаяСтрока.МоментПоследнейЗагрузки  = ТекущаяДатаСеанса();
			КонецЦикла;
		КонецЕсли;
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьМоментВыгрузкиВВесы(Команда)
	
	УстановитьМоментВыгрузкиВВесыНаСервере();
	ОбновитьИнтерфейс();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьМоментВыгрузкиВКассыНаСервере()
	
	Для Каждого Строка Из Элементы.СписокОборудования.ВыделенныеСтроки Цикл
		НаборЗаписей = РегистрыСведений.МоментыПоследнейЗагрузки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Оборудование.Установить(Строка.Ссылка);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.ВидЗагружаемойИнформации = Перечисления.ВидыЗагружаемойИнформации.Товары;
			НоваяЗапись.НомерPOS                 = 0;
			НоваяЗапись.МоментПоследнейЗагрузки  = ТекущаяДатаСеанса();
		Иначе
			Для Каждого ТекущаяСтрока Из НаборЗаписей Цикл
				ТекущаяСтрока.МоментПоследнейЗагрузки  = ТекущаяДатаСеанса();
			КонецЦикла;
		КонецЕсли;
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьМоментВыгрузкиВКассы(Команда)
	
	УстановитьМоментВыгрузкиВКассыНаСервере();
	ОбновитьИнтерфейс();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьШаблоныЭтикеток(Команда)
	
	ВыделенныеСтроки = Элементы.Весы.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество()>0 Тогда
		
		Устройства = Новый Массив;
		Для Каждого ТекущаяСтрока Из ВыделенныеСтроки Цикл
			Устройства.Добавить(ТекущаяСтрока);
		КонецЦикла;
		
		ПодключаемоеОборудованиеOfflineКлиент.ВыгрузитьШаблоныВВесы(Неопределено, Устройства);
		
	Иначе
		
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Команда не может быть выполнена для указанного объекта'"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСДатойНачала(Команда)
	
	ДатаЗагрузки=НачалоДня(ТекущаяДата());
	Если ВвестиДату(ДатаЗагрузки,"Введите дату начала загрузки") = Истина Тогда
		Если ЗначениеЗаполнено(ДатаЗагрузки) Тогда 
			ТекущиеДанные = Элементы.СписокОборудования.ТекущиеДанные;
			
			Если ТекущиеДанные = Неопределено Тогда
				Возврат;
			КонецЕсли;
			
			Элементы.СтраницыСтатусФоновогоЗадания.ТекущаяСтраница = Элементы.ЗаданиеВыполняется;
			Элементы.ДлительнаяОперацияПояснение.Заголовок = "Загрузка данных из оборудования <" + СокрЛП(ТекущиеДанные.Ссылка)+">";
			
			ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
			ПараметрыОжидания.ВыводитьПрогрессВыполнения     = Истина;
			ПараметрыОжидания.ВыводитьОкноОжидания           = Ложь;
			ПараметрыОжидания.ВыводитьСообщения              = Истина;
			ПараметрыОжидания.ОповещениеОПрогрессеВыполнения = Новый ОписаниеОповещения("ОбработатьПрогресс", ЭтотОбъект);

			ПараметрыДанных = Новый Структура;
			ПараметрыДанных.Вставить("ПараметрыОжидания", ПараметрыОжидания);
			ПараметрыДанных.Вставить("ДатаЗагрузки", 	  ДатаЗагрузки);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеОперации", ЭтотОбъект);
			
			МенеджерОборудованияРарусКлиент.ВыполнитьКомандуОборудования("ЗагрузитьДанные", ТекущиеДанные.Ссылка, УникальныйИдентификатор, ОписаниеОповещения, ПараметрыДанных);
	
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьПолныйПрайсЛистБезФото(Команда)
	
	ТекущиеДанные = Элементы.СписокОборудования.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если (НЕ ВыгружатьПерсонал) И (НЕ ВыгружатьСкидки) И (НЕ ВыгружатьТовары) Тогда
		ТекстСообщения = НСтр("ru = 'Не указаны параметры выгрузки: Товары, Скидки или Персонал'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПараметрыДанных = Новый Структура;
	ПараметрыДанных.Вставить("ПолнаяВыгрузка",    Истина);
	ПараметрыДанных.Вставить("ВыгружатьТовары",   ВыгружатьТовары);
	ПараметрыДанных.Вставить("ВыгружатьСкидки",   ВыгружатьСкидки);
	ПараметрыДанных.Вставить("ВыгружатьПерсонал", ВыгружатьПерсонал);
	ПараметрыДанных.Вставить("ВыгружатьФото", 	  Ложь);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеОперации", ЭтотОбъект);
	
	МенеджерОборудованияРарусКлиент.ВыполнитьКомандуОборудования("ВыгрузитьДанные", ТекущиеДанные.Ссылка, УникальныйИдентификатор, ОписаниеОповещения, ПараметрыДанных);
	

КонецПроцедуры

&НаКлиенте
Процедура НастройкаСортировкиКСО(Команда)
	ОткрытьФорму("Обработка.ОбменСОфлайнОборудованием.Форма.ФормаСортировкаВГруппеКСО");
КонецПроцедуры

#КонецОбласти
